//
//  data.swift
//  00557117
//
//  Created by User19 on 2019/10/9.
//  Copyright © 2019 557021. All rights reserved.
//

import Foundation

let songs = [Song(name: "宮永咲", singer: "澄清高中大將", lyrics: "1年級生。生日是10月27日，天蠍座。膽小又愛哭的冒失娘，路痴。但是打麻將時近乎「看得見」一樣的直覺和運氣。現在與父親同住，分居中的母親和姊姊宮永照住在東京。最初受家庭麻將的影響而變得討厭麻將，從那時起就一直只以±0作為打麻將的目標( 因為小時候家裡只有新年會打麻將，輸了就沒有壓歲錢，可是贏了又會被罵，所以學會每次都把分數調整成沒輸沒贏±0的打法）。在遇到原村和後，認為可以透過麻將來消解與姊姊的爭執，決定認真地打以取勝為目標的麻將。"),
Song(name: "原村和", singer: "澄清高中副將", lyrics: "1年級生，巨乳。生日是10月4日，天秤座。具有全國國中生麻將大賽個人戰冠軍經驗的實力派。不依靠運氣的完全理論派打法。也不相信有如咲等人那樣不可思議的超自然能力，認為不過是巧合所造成；曾說若是連續和牌10次以上，她才會考慮別的理由。對比賽認真，討厭對手手下留情。雖然父親寄望她能去東京升學而反對其打麻將，但為了繼續留在這結識到朋友的小鎮，與父親約好在高中生麻將大會中要是取得冠軍的話就可以留下來。"),
Song(name: "竹井久", singer: "澄清高中中堅", lyrics: "3年級生。學生議會會長兼麻將部部長。生日是11月13日，天蠍座。以大會冠軍為目標而燃起了沉著的鬥志。國中3年級時以「上埜久（上埜 久（うえの ひさ））」的名字參加過全國國中生麻將大會，而後因家庭變故改姓竹井。得到所有部員的完全信任。遇到重要的牌面時會傾向較難湊成胡的單吊或中洞，不知為何總是有那樣做就能勝出的不可思議的能力。因此雖然被和責怪「特地用不利於自己的方式來聽牌，實在搞不懂」，於清澄高中擔任中堅。"),
Song(name: "染谷真子", singer: "澄清高中次鋒", lyrics: "家中經營一間名叫「Roof-top（屋頂)」的麻將館，是以讓女員工穿著女傭服來代打作為賣點的「女傭麻將館」。平時戴著眼鏡，實力正如她的眼睛一樣被眼鏡遮蓋住。不過，在重要的場面會取下眼鏡，讓視線變得模糊不清，可以一邊回憶過去的無數次對局的景象一邊打麻將，從中抽取與現在桌上相似的映像。"),
Song(name: "片岡優希", singer: "澄清高中先鋒", lyrics: "1年級生。性格無憂無慮而天然呆。生日是9月16日，處女座。最喜歡的食物是墨西哥卷餅，就讀清澄高中的原因是清澄的學生餐廳有賣墨西哥卷餅。墨西哥卷餅（タコス）之外，一吃了章魚燒（タコ焼）之類名字中有「章魚（タコ）」讀音開頭的食物就能提起精神。說話中會帶有「じぇ」和「じょ」之類的語尾。制服的設計跟其他的角色不同。捉弄京太郎的描寫特別多。打法屬速攻型，東風圈（比賽的前半）時強勢而越到後半場就越轉弱勢的類型，簡單來說就是沒恆心的類型（三分鐘熱度），完全不懂計算分數的差距，於清澄高中擔任先鋒。在東風圈時通常以立直進攻。在訓練後開始使用鳴牌速攻，使胡牌的速度增快。")]

let dragon_high_school = [Song(name: "天江衣", singer: "龍門淵高中大將", lyrics: "2年級生。生日是9月6日，處女座。雖然外表和性格都很像小孩，但在需要展現實力的時候會表現出充滿自信的態度與壓迫感來壓倒對手。又很會說挖苦的話，但其實本性率直。雖然看起來是跟外行人一樣的打法，但在去年的縣際比賽中勝出，又曾在友誼賽讓藤田雀士獲敗的新人。有「滿月之衣」之稱號。常被人當作小孩來看待，而她也討厭這樣，因此對「小女孩」這個詞反應過剩。跟龍門淵透華是表姊妹關係。喜歡玩弄所有對局的對手。受到父親的影響，說話的時候多用比較古老難懂的單詞。是藤田雀士所說去年「被牌所眷顧的女孩」中的一人，也是全國魔王級人物的一人。使用海底撈月及令所有對手出現「地獄一向聽」的能力，接近晚上及月圓時能力最強，擔任龍門淵大將。"),
    Song(name: "龍門淵透華", singer: "龍門淵高中副將", lyrics: "2年級生。生日是9月10日，處女座。龍門淵高中四天王之一，天江衣的表妹。以「引人注目才有用」為信條的大小姊。理論派（數值化）的打法。視原村和為強勁的競爭對手。在遇到過多強手時會變成「冷淡的透華」，實力會突然變得非常強，態度也變得很冷淡，但自己並不會察覺，隱藏能力可能是明鏡止水[3]。桌球水平相當高。頭頂中間有呆毛，會因應心情而擺動。興奮的時候，呆毛會直立起來。擔任龍門淵高中副將。")]

let wall = [Song(name: "照片牆",singer: " ", lyrics: "1。")]

let pictures = [picture(name:"天才麻將少女１"),
                picture(name:"天才麻將少女２"),
                picture(name:"天才麻將少女３"),
                picture(name:"天才麻將少女４")]
